app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $id = user()->id;

        $data = [
            'title' => 'Dasbor',
            'fields' => $this->fieldModel->findAll(),
            'seminars' => $this->seminarModel->findAll(),
            'users' => $this->userModel->where('id !=', $id)->findAll(),
            'latest_users' => $this->userModel->where('id !=', $id)->orderBy('created_at','DESC')->asObject()->findAll(5),
            'criterias' => $this->criteriasModel->findAll(),
            'profile' => $this->userModel->where('id',$id)->first()
---
SELECT *
FROM `seminars`
SELECT *
FROM `users`
WHERE `id` != '1'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `id` != '1'
AND `users`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `criterias`
SELECT *
FROM `users`
WHERE `id` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function seminar()
    {
        $id = user()->id;

        $data = [
            'title' => 'Seminar',
            'fields' => $this->fieldModel->findAll(),
            'seminars' => $this->seminarModel->select('seminars.*, field_seminars.name')->join('field_seminars','seminars.field_id=field_seminars.id')->asObject()->findAll(),
            'users' => $this->userModel->where('id !=', $id)->findAll(),
            'criterias' => $this->criteriasModel->findAll(),
            'profile' => $this->userModel->where('id',$id)->first()
---
SELECT `seminars`.*, `field_seminars`.`name`
FROM `seminars`
JOIN `field_seminars` ON `seminars`.`field_id`=`field_seminars`.`id`
SELECT *
FROM `users`
WHERE `id` != '1'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `criterias`
SELECT *
FROM `users`
WHERE `id` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function comprehension()
    {
        if(isset($_GET['seminar_id'])) {
            if(!$this->validate([
                'seminar_id' => [
                    'rules' => 'required',
                    'label' => 'Judul Seminar'
                ]
            ])) {
                return redirect()->back()->withInput()->with('failed', 'Data Pemahaman Seminar Gagal Dilihat!');
            }
        }

        $id = user()->id;

        $data = [
            'title' => 'Tingkat Pemahaman',
            'fields' => $this->fieldModel->findAll(),
            'seminars' => $this->seminarModel->asObject()->findAll(),
            'users' => $this->userModel->where('id !=', $id)->findAll(),
            'criterias' => $this->criteriasModel->asObject()->findAll(),
            'profile' => $this->userModel->where('id',$id)->first(),
            'validation' => \Config\Services::validation()
        ];

        if(isset($_GET['seminar_id'])) {
            $seminar_id = $this->request->getGet('seminar_id');
            $this->participantModel->spk($seminar_id);

            $data['seminar'] = $this->seminarModel->where('id',$seminar_id)->asObject()->first();
            $data['participants'] = $this->participantModel->where('seminar_id',$seminar_id)->findAll();
            $data['class_1'] = $this->participantModel->select('participant_seminars.*, users.fullname')->join('users','participant_seminars.user_id=users.id')->where(['percentage >' => 80, 'seminar_id' => $seminar_id])->orderBy('percentage','DESC')->asObject()->findAll();
            $data['class_2'] = $this->participantModel->select('participant_seminars.*, users.fullname')->join('users','participant_seminars.user_id=users.id')->where(['percentage >' => 60, 'percentage <' => 81, 'seminar_id' => $seminar_id])->orderBy('percentage','DESC')->asObject()->findAll();
            $data['class_3'] = $this->participantModel->select('participant_seminars.*, users.fullname')->join('users','participant_seminars.user_id=users.id')->where(['percentage >' => 49, 'percentage <' => 61, 'seminar_id' => $seminar_id])->orderBy('percentage','DESC')->asObject()->findAll();
            $data['class_4'] = $this->participantModel->select('participant_seminars.*, users.fullname')->join('users','participant_seminars.user_id=users.id')->where(['percentage <' => 50, 'seminar_id' => $seminar_id])->orderBy('percentage','DESC')->asObject()->findAll();
---
SELECT *
FROM `seminars`
SELECT *
FROM `users`
WHERE `id` != '1'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `criterias`
SELECT *
FROM `users`
WHERE `id` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `seminars`
WHERE `id` = '1'
 LIMIT 1
SELECT `participant_seminars`.*, `users`.`fullname`
FROM `participant_seminars`
JOIN `users` ON `participant_seminars`.`user_id`=`users`.`id`
WHERE `percentage` > 80
AND `seminar_id` = '1'
ORDER BY `percentage` DESC
SELECT `participant_seminars`.*, `users`.`fullname`
FROM `participant_seminars`
JOIN `users` ON `participant_seminars`.`user_id`=`users`.`id`
WHERE `percentage` > 60
AND `percentage` < 81
AND `seminar_id` = '1'
ORDER BY `percentage` DESC
SELECT `participant_seminars`.*, `users`.`fullname`
FROM `participant_seminars`
JOIN `users` ON `participant_seminars`.`user_id`=`users`.`id`
WHERE `percentage` > 49
AND `percentage` < 61
AND `seminar_id` = '1'
ORDER BY `percentage` DESC
SELECT `participant_seminars`.*, `users`.`fullname`
FROM `participant_seminars`
JOIN `users` ON `participant_seminars`.`user_id`=`users`.`id`
WHERE `percentage` < 50
AND `seminar_id` = '1'
ORDER BY `percentage` DESC