app/Controllers/Student/Dashboard.php

    public function participant()
    {
        $id = user()->id;

        $data = [
            'title' => 'Keikutsertaan Seminar',
            'participants' => $this->participantModel->select('participant_seminars.*, seminars.title, seminars.presenter')->join('seminars','participant_seminars.seminar_id=seminars.id')->where('user_id',$id)->asObject()->findAll(),
            'profile' => $this->userModel->where('id',$id)->first()
---
SELECT `participant_seminars`.*, `seminars`.`title`, `seminars`.`presenter`
FROM `participant_seminars`
JOIN `seminars` ON `participant_seminars`.`seminar_id`=`seminars`.`id`
WHERE `user_id` = '7'
SELECT *
FROM `users`
WHERE `id` = '7'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function getseminar()
    {
        $get = $this->seminarModel->where('id',$this->request->getGet('seminar_id'))->asObject()->first();
---
SELECT *
FROM `seminars`
WHERE `id` = '2'
 LIMIT 1

    public function comprehension()
    {
        if(isset($_GET['seminar_id'])) {
            if(!$this->validate([
                'seminar_id' => [
                    'rules' => 'required',
                    'label' => 'Judul Seminar'
                ]
            ])) {
                return redirect()->back()->withInput()->with('failed', 'Data Pemahaman Seminar Gagal Dilihat!');
            }
        }

        $id = user()->id;

        $data = [
            'title' => 'Pemahaman Seminar',
            'participants' => $this->participantModel->where('user_id',$id)->findAll(),
            'seminars' => $this->seminarModel->select('seminars.*')->join('participant_seminars','participant_seminars.seminar_id=seminars.id')->where('user_id',$id)->asObject()->findAll(),
            'profile' => $this->userModel->where('id',$id)->first(),
            'validation' => \Config\Services::validation()
        ];

        if(isset($_GET['seminar_id'])) {
            $seminar_id = $this->request->getGet('seminar_id');
            $this->participantModel->spk($seminar_id);

            $data['seminar'] = $this->seminarModel->where('id',$seminar_id)->asObject()->first();
            $data['criterias'] = $this->criteriasModel->asObject()->findAll();
---
SELECT `seminars`.*
FROM `seminars`
JOIN `participant_seminars` ON `participant_seminars`.`seminar_id`=`seminars`.`id`
WHERE `user_id` = '7'
SELECT *
FROM `users`
WHERE `id` = '7'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `participant_seminars`
WHERE `user_id` = '7'
AND `seminar_id` = '1'
 LIMIT 1
SELECT *
FROM `seminars`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `criterias`