app/Models/ParticipantModel.php

    public function spk($seminar_id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('participant_seminars');
        $query_c1 = $builder->select('criteria_1')->where('seminar_id',$seminar_id)->get();
        $query_c2 = $builder->select('criteria_2')->where('seminar_id',$seminar_id)->get();
        $query_c3 = $builder->select('criteria_3')->where('seminar_id',$seminar_id)->get();
        $query_c4 = $builder->select('criteria_4')->where('seminar_id',$seminar_id)->get();
        $query_c5 = $builder->select('criteria_5')->where('seminar_id',$seminar_id)->get();

        $builder_criteria = $db->table('criterias');
        $query_criteria = $builder_criteria->get();
        $array_c1 = array();
        $array_c2 = array();
        $array_c3 = array();
        $array_c4 = array();
        $array_c5 = array();

        foreach($query_criteria->getResult() as $c) {
            if($c->id == '1') {
                foreach($query_c1->getResult() as $c1) {
                    if($c->keterangan == '1') {
                        $builder->selectMax('criteria_1', 'max_c1')->where('seminar_id',$seminar_id);
                        $query_max = $builder->get();
---
SELECT `criteria_1`
FROM `participant_seminars`
WHERE `seminar_id` = '1'
SELECT `criteria_2`
FROM `participant_seminars`
WHERE `seminar_id` = '1'
SELECT `criteria_3`
FROM `participant_seminars`
WHERE `seminar_id` = '1'
SELECT `criteria_4`
FROM `participant_seminars`
WHERE `seminar_id` = '1'
SELECT `criteria_5`
FROM `participant_seminars`
WHERE `seminar_id` = '1'
SELECT *
FROM `criterias`
SELECT MAX(`criteria_1`) AS `max_c1`
FROM `participant_seminars`
WHERE `seminar_id` = '1'